Shader "BP/5.基础纹理载入"
{
    //-------------------------------【属性】-----------------------------------------
    Properties
    {
        //纹理
        _MainTex("基本纹理",2D)="White"{TexGen SphereMap}
    }
    //---------------------------------【子着色器】----------------------------------
    SubShader
    {
        //----------------通道---------------
        Pass
        {
            //设置纹理为属性中选择的纹理
            SetTexture[_MainTex]{combine texture}
        }
    }
    //---------------------------------【备胎】----------------------------------------
    //备胎设为Unity自带的普通漫反射
    Fallback " Diffuse "
}